espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG22/Include/efm32pg22_gpio.h
/* Bit fields for GPIO_EUART CTSROUTE */
#define _GPIO_EUART_CTSROUTE_RESETVALUE                 0x00000000UL                             /**< Default value for GPIO_EUART_CTSROUTE       */
#define _GPIO_EUART_CTSROUTE_MASK                       0x000F0003UL                             /**< Mask for GPIO_EUART_CTSROUTE                */
#define _GPIO_EUART_CTSROUTE_PORT_SHIFT                 0                                        /**< Shift value for GPIO_PORT                   */
#define _GPIO_EUART_CTSROUTE_PORT_MASK                  0x3UL                                    /**< Bit mask for GPIO_PORT                      */
#define _GPIO_EUART_CTSROUTE_PORT_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for GPIO_EUART_CTSROUTE        */
#define GPIO_EUART_CTSROUTE_PORT_DEFAULT                (_GPIO_EUART_CTSROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_EUART_CTSROUTE*/
#define _GPIO_EUART_CTSROUTE_PIN_SHIFT                  16                                       /**< Shift value for GPIO_PIN                    */
#define _GPIO_EUART_CTSROUTE_PIN_MASK                   0xF0000UL                                /**< Bit mask for GPIO_PIN                       */
#define _GPIO_EUART_CTSROUTE_PIN_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for GPIO_EUART_CTSROUTE        */
#define GPIO_EUART_CTSROUTE_PIN_DEFAULT                 (_GPIO_EUART_CTSROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_EUART_CTSROUTE*/

/* Bit fields for GPIO_EUART RTSROUTE */
#define _GPIO_EUART_RTSROUTE_RESETVALUE                 0x00000000UL                             /**< Default value for GPIO_EUART_RTSROUTE       */
#define _GPIO_EUART_RTSROUTE_MASK                       0x000F0003UL                             /**< Mask for GPIO_EUART_RTSROUTE                */
#define _GPIO_EUART_RTSROUTE_PORT_SHIFT                 0                                        /**< Shift value for GPIO_PORT                   */
#define _GPIO_EUART_RTSROUTE_PORT_MASK                  0x3UL                                    /**< Bit mask for GPIO_PORT                      */
#define _GPIO_EUART_RTSROUTE_PORT_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for GPIO_EUART_RTSROUTE        */
#define GPIO_EUART_RTSROUTE_PORT_DEFAULT                (_GPIO_EUART_RTSROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_EUART_RTSROUTE*/
#define _GPIO_EUART_RTSROUTE_PIN_SHIFT                  16                                       /**< Shift value for GPIO_PIN                    */
#define _GPIO_EUART_RTSROUTE_PIN_MASK                   0xF0000UL                                /**< Bit mask for GPIO_PIN                       */
#define _GPIO_EUART_RTSROUTE_PIN_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for GPIO_EUART_RTSROUTE        */
#define GPIO_EUART_RTSROUTE_PIN_DEFAULT                 (_GPIO_EUART_RTSROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_EUART_RTSROUTE*/

/* Bit fields for GPIO_EUART RXROUTE */
#define _GPIO_EUART_RXROUTE_RESETVALUE                  0x00000000UL                            /**< Default value for GPIO_EUART_RXROUTE        */
#define _GPIO_EUART_RXROUTE_MASK                        0x000F0003UL                            /**< Mask for GPIO_EUART_RXROUTE                 */
#define _GPIO_EUART_RXROUTE_PORT_SHIFT                  0                                       /**< Shift value for GPIO_PORT                   */
#define _GPIO_EUART_RXROUTE_PORT_MASK                   0x3UL                                   /**< Bit mask for GPIO_PORT                      */
#define _GPIO_EUART_RXROUTE_PORT_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for GPIO_EUART_RXROUTE         */
#define GPIO_EUART_RXROUTE_PORT_DEFAULT                 (_GPIO_EUART_RXROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_EUART_RXROUTE */
#define _GPIO_EUART_RXROUTE_PIN_SHIFT                   16                                      /**< Shift value for GPIO_PIN                    */
#define _GPIO_EUART_RXROUTE_PIN_MASK                    0xF0000UL                               /**< Bit mask for GPIO_PIN                       */
#define _GPIO_EUART_RXROUTE_PIN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for GPIO_EUART_RXROUTE         */
#define GPIO_EUART_RXROUTE_PIN_DEFAULT                  (_GPIO_EUART_RXROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_EUART_RXROUTE */

/* Bit fields for GPIO_EUART TXROUTE */
#define _GPIO_EUART_TXROUTE_RESETVALUE                  0x00000000UL                            /**< Default value for GPIO_EUART_TXROUTE        */
#define _GPIO_EUART_TXROUTE_MASK                        0x000F0003UL                            /**< Mask for GPIO_EUART_TXROUTE                 */
#define _GPIO_EUART_TXROUTE_PORT_SHIFT                  0                                       /**< Shift value for GPIO_PORT                   */
#define _GPIO_EUART_TXROUTE_PORT_MASK                   0x3UL                                   /**< Bit mask for GPIO_PORT                      */
#define _GPIO_EUART_TXROUTE_PORT_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for GPIO_EUART_TXROUTE         */
#define GPIO_EUART_TXROUTE_PORT_DEFAULT                 (_GPIO_EUART_TXROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_EUART_TXROUTE */
#define _GPIO_EUART_TXROUTE_PIN_SHIFT                   16                                      /**< Shift value for GPIO_PIN                    */
#define _GPIO_EUART_TXROUTE_PIN_MASK                    0xF0000UL                               /**< Bit mask for GPIO_PIN                       */
#define _GPIO_EUART_TXROUTE_PIN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for GPIO_EUART_TXROUTE         */
#define GPIO_EUART_TXROUTE_PIN_DEFAULT                  (_GPIO_EUART_TXROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_EUART_TXROUTE */

/* Bit fields for GPIO_PDM ROUTEEN */
#define _GPIO_PDM_ROUTEEN_RESETVALUE                    0x00000000UL                            /**< Default value for GPIO_PDM_ROUTEEN          */
#define _GPIO_PDM_ROUTEEN_MASK                          0x00000001UL                            /**< Mask for GPIO_PDM_ROUTEEN                   */
#define GPIO_PDM_ROUTEEN_CLKPEN                         (0x1UL << 0)                            /**< CLK pin enable control bit                  */
#define _GPIO_PDM_ROUTEEN_CLKPEN_SHIFT                  0                                       /**< Shift value for GPIO_CLKPEN                 */
#define _GPIO_PDM_ROUTEEN_CLKPEN_MASK                   0x1UL                                   /**< Bit mask for GPIO_CLKPEN                    */
#define _GPIO_PDM_ROUTEEN_CLKPEN_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for GPIO_PDM_ROUTEEN           */
#define GPIO_PDM_ROUTEEN_CLKPEN_DEFAULT                 (_GPIO_PDM_ROUTEEN_CLKPEN_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_PDM_ROUTEEN   */

